// first check if single is an ep then replace album_type with EP.
// ep is 4-7 songs?

Bloom - aquilya - SINGLE

Never Need Me - rachel - NEW ALBUM

Simple Things - Emotional Oranges - Blended - EP

** Wandering Souls - Essence Martins - deer in headlights ep

GARDEN - KAMAUU - GARDEN - SINGLE

Best You Ever Had - Kita Alexander - All Night (feat. LAUREL) - SINGLE/ep

** This City - Sam Fischer - i love you, please don't hate me - album

No Fear - DeJ Loaf - No Fear - SINGLE

Mr Right (with Meghan Trainor) - Mae Stephens - Mr Right (with Meghan Trainor) - SINGLE

Hello - Aqyila - For the Better - EP

Chillin' Like a Villain - Sofia Carson - Descendants 2 (Original TV Movie Soundtrack) - COMPILATION

City On A Hill - Mon RovÎa - City On A Hill - SINGLE

Envy - Ogi - Monologues - EP

** Harleys In Hawaii - Katy Perry - Smile - album

** Back To Life - Fabich - bring me back to life - ep

All I Ever Asked - Rachel Chinouriri - All I Ever Asked - SINGLE

Play It Right - KAWALA - Play It Right - SINGLE

Assumptions - Sam Gellaitry - IV - EP

** Blindside - James Arthur - Bitter sweet love album

** OH! - Aqyila - for the better ep

** Hello - Aqyila - merge with other hello

Euphoria - Robert Grace - Euphoria - SINGLE

** What's Love (feat. MUNA) - Empress Of - preciosa []

show me // something - Gianni´s Humble - show me // something - SINGLE

** Reckless Tongue - Airways - starting to spin ep

Don't Say Love - Leigh-Anne - Don't Say Love - SINGLE

Go - McClain Sisters - Go - SINGLE

Black Sheep - Brie Larson Vocal Version / Bonus Track - Metric - Scott Pilgrim Vs. The World (Original Motion Picture Soundtrack Expanded Edition) - COMPILATION

My Destiny - Lionel Richie - Back To Front - COMPILATION // how to deal with compilations? if theres no album then leave it?

Small room - Chenayder - Small room - SINGLE

16 CARRIAGES - Beyoncé - 16 CARRIAGES - SINGLE

** Before the Worst - The Script - the script  aklbum

IT GIRL - Aliyah's Interlude - IT GIRL - SINGLE

Starz In Their Eyes - Radio Edit - Just Jack - Starz In Their Eyes (Esingle) - SINGLE // what do i do about radio edits? how to find the album version?

It's Goin' Down - Dove Cameron - Descendants 2 (Original TV Movie Soundtrack) - COMPILATION

What's My Name - China Anne McClain - Descendants 2 (Original TV Movie Soundtrack) - COMPILATION

So My Darling - Acoustic - Rachel Chinouriri - So My Darling (Acoustic) - SINGLE // new album

The Man Who Can't Be Moved - The Script - the script album

Fall - Chenayder - Fall - SINGLE

TEXAS HOLD 'EM - Beyoncé - TEXAS HOLD 'EM - SINGLE

a girl like me - flowerovlove - a girl like me - SINGLE

Death By Laundry - Sarah Crean - Death By Laundry - EP

** Breathing - Great Good Fine Ok - breathing single  or  - make this momemnt last ep

** Moving Like That - Aqyila - breathing keep "single"/ep // has 3 tracks tho

Everyday - Troy - High School Musical 2 (Original Soundtrack) - COMPILATION

You Are the Music in Me - Sharpay Version - Sharpay Evans - High School Musical 2 (Original Soundtrack) - COMPILATION

** Sea Blue - BLOXX - Sea Blue - headspace ep

ファックラブ - ぬいぐるみクレヨン Lush Crayon - 本物のオリジナル - EP

High School Musical - High School Musical Cast - High School Musical 3 - Senior Year - COMPILATION

Just Wanna Be With You - High School Musical Cast - High School Musical 3 - Senior Year - COMPILATION

** Pressure - Aqyila - for the better ep

Bad News - HALFnHALF - Bad News - SINGLE

** Next 2 U - Sheila and The Kit - yeah album

Dancing Off My Sins - Capital Soiree - Dancing Off My Sins - SINGLE

** Flatline - Orla Gartland - why am i like this ep

**Blame - Great Good Fine Ok - Breathing - SINGLE or  - make this momemnt last ep

**Nowhere - Emotional Oranges - blended ep

Alien - Sabrina Carpenter - Alien - SINGLE

**Brussel Sprouts - Essence Martins - deer in headlights

Lil Boo Thang - Paul Russell - Lil Boo Thang - SINGLE

02:00 AM - Sarah Crean - 02:00 AM - SINGLE

**We Cry - The Script - the script album

We Keep On - Aqyila - For the Better - EP

Tonight - Nonso Amadi - Tonight - SINGLE

Georgia - Emily King - The Seven EP - EP

**IT GIRL - Aliyah's Interlude - IT GIRL - SINGLE merge with other it girl?

Talking 2 Myself - Billy Vena - Talking 2 Myself - SINGLE

**Pending Status - Essence Martins - deer in headlights

Girls Don't Cry - Young Franco - Girls Don't Cry - SINGLE

**Colour - MNEK - language album

Being Human - Clark May - Being Human - SINGLE

**Dance The Night - From Barbie The Album - Dua Lipa - barbie album // get barbie album but might need to remove search title? idk

Catchy Song (feat. T-Pain & That Girl Lay Lay) - Dillon Francis - The LEGO Movie 2: The Second Part (Original Motion Picture Soundtrack) - COMPILATION

In My Head - Emotional Oranges - Blended - EP

Bop To The Top - Ryan - High School Musical Original Soundtrack - COMPILATION

**Ain't No Stoppin' Us Now - Single Version - McFadden & Whitehead - The Best Of Philadelphia International Records - COMPILATION // can i get longer version from 1979 album selftitled

Back To School Again - Four Tops - Grease 2 (Original Motion Picture Soundtrack) - COMPILATION

Made For Me - Muni Long - Made For Me - SINGLE

This Is What You Came For - Calvin Harris - This Is What You Came For - SINGLE

Can't Explain It (feat. Charlie Wilson) - CHIKA - Can't Explain It (feat. Charlie Wilson) - SINGLE

I’m Just Ken - Ryan Gosling - Barbie The Album - COMPILATION

Person in the Mirror - Naethan Apollo - Person in the Mirror - SINGLE

Houdini - Dua Lipa - Houdini - SINGLE

Vitamins - Qveen Herby - EP 7 - EP

Love Me Back - Bebe Stockwell - Love Me Back - SINGLE

What I've Been Looking For - Ryan - High School Musical Original Soundtrack - COMPILATION

Breaking Free - Troy - High School Musical Original Soundtrack - COMPILATION

**Water - Tyla - tyla ep

What I've Been Looking For (Reprise) - From "High School Musical"/Soundtrack Version - Troy - High School Musical Original Soundtrack - COMPILATION

FANCY - TWICE - FANCY YOU - EP

**greedy - Tate McRae - thjink later album

Love Like This (Stripped Version) - Remix - Faith Evans - Love Like This (Stripped Version) [Remix] - SINGLE

Stick to the Status Quo - High School Musical Cast - High School Musical Original Soundtrack - COMPILATION

yes, and? - Ariana Grande - yes, and? - SINGLE

Single Soon - Selena Gomez - Single Soon - SINGLE

Spotify Logo
Customise Image
Your name
Include artist and album name
Download image
Created by Natalie Ayuba

•
Home
About
Policy
Spotify Logo